{
  "de": "Proficiency in programming languages such as Python, Java, or Scala, with a strong understanding of object-oriented programming and functional programming paradigms.\nExperience with ETL (Extract, Transform, Load) processes, including designing efficient data pipelines, transforming data formats, and optimizing data flow between different systems.\nFamiliarity with big data technologies (e.g., Hadoop, Spark), understanding distributed computing concepts, and handling large datasets efficiently.\nUnderstanding of data warehousing solutions (e.g., Amazon Redshift, Snowflake) to manage and query large-scale datasets.\nExpertise in database management systems (SQL and NoSQL), including designing optimized schema, indexing strategies, and writing complex queries for performance.\nStrong analytical and problem-solving skills for creating robust data architectures that scale with business needs.\nKnowledge of data modeling (e.g., ER diagrams, dimensional models) and schema design techniques to organize complex datasets.\nExperience with data integration tools (e.g., Apache NiFi, Talend), ensuring seamless integration of disparate data sources and ensuring data quality.\nAbility to optimize data storage and retrieval through techniques such as partitioning, indexing, and caching to improve system performance.",
  
  "ai": "Proficiency in programming languages such as Python or R, with a deep understanding of libraries like NumPy, Pandas for data manipulation, and frameworks like TensorFlow or PyTorch for building and training machine learning models.\nExperience with machine learning algorithms, including supervised and unsupervised learning techniques, reinforcement learning, and the ability to select the appropriate algorithm based on data.\nFamiliarity with deep learning models such as convolutional neural networks (CNNs), recurrent neural networks (RNNs), and transformer architectures.\nIn-depth knowledge of data preprocessing, feature engineering, and handling missing data or outliers to improve model accuracy.\nExperience with AI deployment, understanding of cloud-based deployment strategies (e.g., AWS SageMaker, Google AI Platform), and ensuring model scalability and availability.\nExpertise in model evaluation techniques like cross-validation, precision-recall, ROC curves, and understanding of bias-variance tradeoff.\nKnowledge of natural language processing (NLP) techniques, including tokenization, stemming, named entity recognition (NER), and word embeddings.\nExperience with version control for machine learning models using tools such as MLflow, Git, and Docker for consistent model deployment.\nAbility to collaborate with data scientists, software engineers, and domain experts to deploy AI-driven solutions efficiently.",
  
  "ds_da": "Proficiency in programming languages like Python, R, or SQL, combined with strong knowledge of statistical analysis and experience using libraries like Scikit-learn or StatsModels.\nExperience with data visualization tools (e.g., Tableau, Power BI), and creating insightful dashboards that enable data-driven decision-making for stakeholders.\nUnderstanding of databases, including relational databases (SQL) and NoSQL databases, with the ability to write optimized queries for data extraction and analysis.\nExperience with data warehousing concepts (e.g., ETL processes, OLAP cubes) and handling large datasets for performing advanced data analysis.\nStrong analytical thinking, with experience applying statistical techniques like hypothesis testing, regression analysis, and clustering to extract actionable insights from data.\nFamiliarity with A/B testing, designing experiments to test hypotheses, and analyzing the results to inform business strategies.\nAbility to communicate data insights effectively to stakeholders through reports, presentations, and visualizations, translating technical results into business terms.\nExperience in building predictive models using machine learning techniques (e.g., linear regression, decision trees, random forests) and conducting data-driven research for improving processes or business strategies.",
  
  "dev": "Proficiency in scripting languages (e.g., Bash, Python) for automating system administration tasks, creating complex scripts for deployment, and managing server environments.\nExperience with CI/CD pipelines using tools such as Jenkins, GitLab CI, or CircleCI to automate the software release process and ensure reliable, repeatable deployments.\nFamiliarity with cloud platforms (e.g., AWS, Azure), including experience with cloud services like EC2, S3, Lambda, and implementing auto-scaling and high availability.\nUnderstanding of containerization technologies (e.g., Docker, Kubernetes), and experience with deploying and managing containerized applications in a production environment.\nStrong analytical and troubleshooting skills for diagnosing system performance issues, optimizing server resources, and implementing fixes or improvements.\nExperience with infrastructure as code (e.g., Terraform, Ansible), creating repeatable and automated server provisioning processes.\nAbility to implement security best practices in deployment, including setting up firewalls, managing access control, and securing data in transit and at rest.\nKnowledge of networking concepts and protocols, including understanding of VPNs, load balancers, and traffic routing to ensure high availability and security of infrastructure.",
  
  "qa": "Proficiency in testing frameworks (e.g., Selenium, JUnit, TestNG) and automation tools to write and execute automated test scripts across various platforms and browsers.\nExperience with manual and automated testing methodologies, including creating detailed test cases, test scripts, and managing the testing lifecycle.\nFamiliarity with bug tracking (e.g., Jira, Bugzilla) and test management tools to track issues and progress, ensuring comprehensive coverage of all test scenarios.\nUnderstanding of the software development life cycle (SDLC), Agile methodologies, and how quality assurance fits into different stages of the process.\nStrong analytical thinking and attention to detail for identifying edge cases, potential failure points, and ensuring the application meets the acceptance criteria.\nAbility to design and execute comprehensive test plans that include functional testing, regression testing, and performance testing, ensuring all features meet specifications.\nExperience with performance and load testing tools (e.g., JMeter, LoadRunner) to evaluate system behavior under heavy load and identify bottlenecks.\nKnowledge of API testing and validation using tools like Postman, ensuring that backend services function correctly and handle edge cases properly.",
  
  "pm": "Experience in product lifecycle management, including defining product vision, creating product roadmaps, and driving product development from ideation to launch.\nStrong understanding of market research techniques, customer surveys, and user feedback analysis to identify pain points and opportunities for product improvement.\nAbility to collaborate effectively with cross-functional teams (engineering, design, marketing), ensuring alignment on product goals, timelines, and deliverables.\nProficiency in product roadmapping tools (e.g., Aha!, Productboard) and prioritization techniques (e.g., MoSCoW, Kano) to ensure the team focuses on the most impactful work.\nStrong analytical and problem-solving skills, including the ability to interpret data, define key performance indicators (KPIs), and make data-driven product decisions.\nExperience with agile methodologies (e.g., Scrum, Kanban), managing sprint planning, backlog grooming, and ensuring the team stays on track to deliver high-quality products.\nAbility to define and measure KPIs to track product success and iteratively improve product offerings.\nSkills in stakeholder management, including clear communication of product vision, updates, and managing expectations across different teams and senior leadership.",
  
  "ux_ui": "Proficiency in design tools (e.g., Sketch, Adobe XD, Figma) to create high-fidelity designs, wireframes, and interactive prototypes that align with user needs and business goals.\nExperience with user research methodologies (e.g., interviews, surveys, focus groups) and usability testing to inform design decisions and validate user experience improvements.\nStrong understanding of user experience principles (e.g., information architecture, user flow) and the ability to design user interfaces that are both visually appealing and functional.\nAbility to create wireframes, prototypes, and visual designs that communicate design concepts clearly to stakeholders and developers.\nStrong analytical thinking to inform design decisions, using data from user behavior, usability testing, and feedback to iterate and improve designs.\nFamiliarity with responsive design techniques, ensuring designs work seamlessly across different devices and screen sizes while adhering to accessibility standards (e.g., WCAG).\nExperience in collaborating with developers to ensure smooth design implementation, working closely during the development phase to ensure pixel-perfect execution of designs.\nAbility to iterate on designs based on user feedback, constantly refining and improving the user experience to meet business and user goals.",
  
  "ts": "Experience in analyzing client needs and developing tailored technical solutions that meet business objectives, focusing on delivering value and aligning with industry standards.\nProficiency in relevant technologies and methodologies, including cloud platforms (e.g., AWS, Azure), software architecture patterns, and best practices in software engineering.\nAbility to communicate complex technical concepts to non-technical stakeholders, breaking down technical details into digestible explanations and making recommendations.\nStrong project management skills, including the ability to define project scope, timelines, and milestones, while managing client expectations and ensuring timely delivery.\nStrong analytical and problem-solving abilities, with experience identifying pain points in client workflows, diagnosing issues, and proposing strategic solutions.\nExperience in developing and delivering presentations to clients, communicating technical approaches, progress updates, and final solutions in a clear and professional manner.\nKnowledge of industry trends, best practices, and emerging technologies to provide clients with up-to-date technical solutions and recommendations.\nAbility to create detailed project documentation and reports, ensuring that all project decisions, technical architectures, and implementation steps are well-documented and communicated.",
  
  "swe": "Proficiency in programming languages such as Python, Java, C++, or JavaScript, with experience in writing clean, efficient, and maintainable code.\nExperience with frameworks like React, Django, or Spring, understanding how to build scalable, secure web applications and APIs.\nFamiliarity with databases (e.g., MySQL, MongoDB), including writing optimized queries, designing database schemas, and ensuring data integrity.\nExperience with debugging tools and methodologies, unit testing, and version control systems (e.g., Git) to manage codebase changes and ensure code quality.\nKnowledge of cloud platforms (e.g., AWS, GCP) and CI/CD pipelines, understanding how to deploy applications in production environments with automated testing and continuous integration.\nExperience with RESTful APIs, containerization (e.g., Docker), and microservices architectures, designing modular, scalable backend systems.\nStrong problem-solving and analytical skills, with a focus on debugging, troubleshooting, and optimizing code for performance and reliability.\nAbility to collaborate with cross-functional teams, including designers, product managers, and other engineers, to deliver high-quality software solutions."
}
