{
    "de": "Proficiency in programming languages such as Python, Java, or Scala.\nExperience with ETL processes and data pipeline development.\nFamiliarity with big data technologies (e.g., Hadoop, Spark) and data warehousing solutions.\nUnderstanding of database management systems (SQL and NoSQL).\nStrong analytical and problem-solving skills for data architecture.\nKnowledge of data modeling and schema design.\nExperience with data integration tools (e.g., Apache NiFi, Talend).\nAbility to optimize data storage and retrieval for performance.",
    "ai": "Proficiency in programming languages like Python or R, and frameworks such as TensorFlow or PyTorch.\nExperience with machine learning algorithms and deep learning models.\nFamiliarity with data preprocessing and feature engineering techniques.\nUnderstanding of AI deployment and model evaluation.\nStrong analytical thinking and problem-solving abilities.\nKnowledge of natural language processing (NLP) and computer vision techniques.\nExperience with version control for machine learning models.\nAbility to collaborate with data scientists and software engineers.",
    "ds_da": "Proficiency in programming languages, statistical analysis, and machine learning algorithms.\nExperience with data visualization tools (e.g., Tableau, Power BI).\nUnderstanding of databases and data warehousing concepts.\nExperience working with large datasets and performing data analysis.\nStrong analytical thinking and problem-solving abilities.\nFamiliarity with A/B testing and experimental design.\nAbility to communicate insights effectively to stakeholders.\nExperience in building predictive models and conducting data-driven research.",
    "dev": "Proficiency in scripting languages (e.g., Bash, Python) and automation tools.\nExperience with CI/CD pipelines and version control systems (e.g., Git).\nFamiliarity with cloud platforms (e.g., AWS, Azure) and containerization technologies (e.g., Docker, Kubernetes).\nUnderstanding of system monitoring and performance optimization.\nStrong analytical and troubleshooting skills.\nExperience with infrastructure as code (e.g., Terraform, Ansible).\nAbility to implement security best practices in deployment.\nKnowledge of networking concepts and protocols.",
    "qa": "Proficiency in testing frameworks and automation tools (e.g., Selenium, JUnit).\nExperience with manual and automated testing methodologies.\nFamiliarity with bug tracking and test management tools.\nUnderstanding of software development life cycle (SDLC) and Agile methodologies.\nStrong analytical thinking and attention to detail.\nAbility to design and execute comprehensive test plans.\nExperience with performance and load testing tools.\nKnowledge of API testing and validation.",
    "pm": "Experience in product lifecycle management and strategy development.\nStrong understanding of market research and user feedback analysis.\nAbility to collaborate with cross-functional teams (engineering, design, marketing).\nProficiency in product roadmapping and prioritization techniques.\nStrong analytical and problem-solving skills to drive product success.\nExperience with agile methodologies and project management tools.\nAbility to define and measure key performance indicators (KPIs).\nSkills in stakeholder management and communication.",
    "ux_ui": "Proficiency in design tools (e.g., Sketch, Adobe XD, Figma).\nExperience with user research methodologies and usability testing.\nStrong understanding of user experience principles and design systems.\nAbility to create wireframes, prototypes, and visual designs.\nStrong analytical thinking to inform design decisions.\nFamiliarity with responsive design and accessibility standards.\nExperience in collaborating with developers for design implementation.\nAbility to iterate designs based on user feedback.",
    "ts": "Experience in analyzing client needs and delivering technical solutions.\nProficiency in relevant technologies and methodologies in the industry.\nAbility to communicate complex technical concepts to non-technical stakeholders.\nStrong project management skills and experience with client engagement.\nStrong analytical and problem-solving abilities to drive strategic initiatives.\nExperience in developing and delivering presentations to clients.\nKnowledge of industry trends and best practices.\nAbility to create detailed project documentation and reports.",
    "swe": "Proficiency in programming languages (e.g., Python, Java, C++).\nExperience with frameworks (e.g., React, Django).\nFamiliarity with databases (e.g., MySQL, MongoDB).\nExperience with debugging, testing, and version control (e.g., Git).\nKnowledge of cloud platforms (e.g., AWS) and CI/CD pipelines.\nExperience with RESTful APIs and containerization (e.g., Docker).\nStrong problem-solving and analytical skills.\nAbility to collaborate with cross-functional teams."
  }
  